public/uploads/bill_files/21/2017-12-06T21:31:42-/request.xml

<?xml version="1.0" encoding="UTF-8"?><env:Envelope xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xmlns:tns="http://facturacion.finkok.com/cancel" xmlns:env="http://schemas.xmlsoap.org/soap/envelope/" xmlns:ins0="http://facturacion.finkok.com/cancellation" xmlns:ins1="apps.services.soap.core.views"><env:Body><tns:cancel>  <tns:UUIDS>
    <tns:uuids>
      <tns:string>5333CF60-A6C5-4EA9-AE44-243DA5BBD146</tns:string>
    </tns:uuids>
  </tns:UUIDS>
  <tns:username>favio.velez@hotmail.com</tns:username>
  <tns:password>Plata353909$</tns:password>
  <tns:taxpayer_id>LAN7008173R5</tns:taxpayer_id>
  <tns:cer>LS0tLS1CRUdJTiBDRVJUSUZJQ0FURS0tLS0tCk1JSUZ4VENDQTYyZ0F3SUJB
Z0lVTWpBd01ERXdNREF3TURBek1EQXdNakk0TVRVd0RRWUpLb1pJaHZjTkFR
RUwKQlFBd2dnRm1NU0F3SGdZRFZRUUREQmRCTGtNdUlESWdaR1VnY0hKMVpX
SmhjeWcwTURrMktURXZNQzBHQTFVRQpDZ3dtVTJWeWRtbGphVzhnWkdVZ1FX
UnRhVzVwYzNSeVlXTnB3N051SUZSeWFXSjFkR0Z5YVdFeE9EQTJCZ05WCkJB
c01MMEZrYldsdWFYTjBjbUZqYWNPemJpQmtaU0JUWldkMWNtbGtZV1FnWkdV
Z2JHRWdTVzVtYjNKdFlXTnAKdzdOdU1Ta3dKd1lKS29aSWh2Y05BUWtCRmhw
aGMybHpibVYwUUhCeWRXVmlZWE11YzJGMExtZHZZaTV0ZURFbQpNQ1FHQTFV
RUNRd2RRWFl1SUVocFpHRnNaMjhnTnpjc0lFTnZiQzRnUjNWbGNuSmxjbTh4
RGpBTUJnTlZCQkVNCkJUQTJNekF3TVFzd0NRWURWUVFHRXdKTldERVpNQmNH
QTFVRUNBd1FSR2x6ZEhKcGRHOGdSbVZrWlhKaGJERVMKTUJBR0ExVUVCd3dK
UTI5NWIyRmp3NkZ1TVJVd0V3WURWUVF0RXd4VFFWUTVOekEzTURGT1RqTXhJ
VEFmQmdrcQpoa2lHOXcwQkNRSU1FbEpsYzNCdmJuTmhZbXhsT2lCQlEwUk5R
VEFlRncweE5qRXdNalV5TVRVeU1URmFGdzB5Ck1ERXdNalV5TVRVeU1URmFN
SUd4TVJvd0dBWURWUVFERXhGRFNVNUVSVTFGV0NCVFFTQkVSU0JEVmpFYU1C
Z0cKQTFVRUtSTVJRMGxPUkVWTlJWZ2dVMEVnUkVVZ1ExWXhHakFZQmdOVkJB
b1RFVU5KVGtSRlRVVllJRk5CSUVSRgpJRU5XTVNVd0l3WURWUVF0RXh4TVFV
NDNNREE0TVRjelVqVWdMeUJHVlVGQ056Y3dNVEUzUWxoQk1SNHdIQVlEClZR
UUZFeFVnTHlCR1ZVRkNOemN3TVRFM1RVUkdVazVPTURreEZEQVNCZ05WQkFz
VUMxQnlkV1ZpWVY5RFJrUkoKTUlJQklqQU5CZ2txaGtpRzl3MEJBUUVGQUFP
Q0FROEFNSUlCQ2dLQ0FRRUFndnZDaUNGREZWYVlYN3hkVlJocAovMzhVTFd0
by9MS0RTWnkxeXJYS3BhcUZYcUVSSldGNzhZSEtmM041R0JvWGd6d0ZQdURY
KzVrdlk1d3RZTnh4Ci9Pd3Uyc2hOWnFGRmg2RUtzeXNRTWVQNXJ6NmtFMWdG
WWVuYVBFVVA5emoraDBiTDN4UjVhcW9Uc3FHRjI0bUsKQkxvaWFLNDRwWEJ6
R3pnc3haaXNoVkpWTTZYYnpOSlZvbkVVTmJJMjVEaGdXQWQ4NmYyYVUzQm1P
SDJLMVJaeAo0MWR0VFQ1NlVzc3pKbHM0dFBGT0RyL2NhV3VaRXVVdkxwMU0z
bmo3RHl1ODhtaEQyZisxZkEvZzdremNVLzF0CmNwRlhGL3JJeTkzQVB2a1U3
Mmp3dmtybnByenMrU25HODErL0YxNmFodUdzYjJFWjg4ZEtId3F4RWt3emhN
eVQKYlFJREFRQUJveDB3R3pBTUJnTlZIUk1CQWY4RUFqQUFNQXNHQTFVZER3
UUVBd0lHd0RBTkJna3Foa2lHOXcwQgpBUXNGQUFPQ0FnRUFKL3hrTDhJK2Zw
aWxaUCs5YU84bjkzKzIwWHhWb21MSmplU0wrTmcyRXJMMkdnYXRwTHVOCjVK
a25GQmtaQWh4VklnTWFUUzIzenprMVJMdFJhWXZIODNsQkg1RStNK2tFakZH
cDE0Rm5lMWlWMlBtM3ZMNGoKZUxtekhnWTFLZjVIbWVWcnJwNFBVN1dRZzE2
VnB5SGFKL2VvblBOaUVCVWpjeVExaUZma3pKbW5TSnZER3RmUQpLMlRpRW9s
REpBcFl2ME9XZG00aXM5QnNmaTlqNmxJOS9UNk1OWisvTE0yTC90NzJWYXU0
cjdtOTRKREV6YU8zCkEwd0hBdFE5N2ZqQmZCaU81TThBRUlTQVY3ZVppZEls
M2lhSkpIa1FiQllpaVcyZ2lrcmVVWktQVVgwSG1sbkkKcXFRY0JKaFdLUnU2
TnFrNmFaQlRFVExMcEdydkY5T0FyVjFKU3NiZHcvWkgrUDg4UkF0NWVtNS9n
and3dEZsTgpIeWlLRzV3K1VGcGFaT0szZ1pQMHN1MHNhNmRsUGVROUVMNEps
RmtHcVFDZ1NRK05Pc1hxYU9hdmdvUDVWTHlrCkx3dUdud0lVbnVoQlRWZURi
enBncmc5THVGNWRZcC96cytZOVNjSnFlNVZNQWFnTFNZVFNoTnROOGx1VjdM
dngKRjlwZ1d3WmRjTTdsVXdxSm1VZGRDaVpxZG5nZzN2elRhY3RNVG9HMTZn
WkE0Q1duTWdiVTRFK3I1NDErRk5NcApnQVpOdnMyQ2lXL2VBcGZhYVFvanNa
RUFIRHNEdjRMNW4zTTFDQzdmWWpFL2Q2MWFTbmcxTGFPNlQxbWgrZEVmClB2
THpwN3p5enorVWdXTWhpNUNzNHBjWHgxZWljNXI3dXhQb0J3Y0NUdDNZSTFq
S1ZWblY3L3c9Ci0tLS0tRU5EIENFUlRJRklDQVRFLS0tLS0K
</tns:cer>
  <tns:key>LS0tLS1CRUdJTiBSU0EgUFJJVkFURSBLRVktLS0tLQpQcm9jLVR5cGU6IDQs
RU5DUllQVEVECkRFSy1JbmZvOiBERVMtRURFMy1DQkMsQUQ2QTFBNjUxMzQ4
MjI1QQoKRGhTeDlaOFcrd1dWS0hxM2RWdzBVU1JRbEUxUTRlN1FOcFhFSXVy
MTU1MUFBYk16Q3pEWmJYTGZaTlB3cmpVcgplRGNPdTJ4SllaZ01yV0FrUXRv
ZlFwRGN1d3ZGTktrSkltdmdORFFBN2M2UE1NUXRQZ3hWN0JoemdpNnlwZFNV
ClA2NXJpOER3QzNpcGhCT2tZbGZNMnc3Y3U2KzZsLzh4N3pMU25zSjhNVllD
RWtnM0RhMWFyb3VPemFGUm03MFkKOVZpTUhhRXMrRDk4b21nbDc5K2JIdDNW
Mm14K2pEREF0dkJFME8vZWVpNEFWUGdFUnU1MENpSllrNktYVHhNVQptbHJl
bndIeHVkbUFualFNbXl2cGszdXFNMEZDRitweTgxRVUzRmVOTTJ4VDJUMmdz
WmRiMStBUEZnb2RjUUJvCnhJU2hMbUxpNEJwMmp0N2c3NGtneWFlWUE5ek1W
WU8vSEdYelk4UTVkMWRUV2ZtblFyUmcvQ2RrZ3VuTm4vTjkKYVZyTm13N2lO
TUthQmNQR2h4SkZ6ODd4dWUyYTA4YTlRWTQ4ZW55SS9TTHhYV2FGdVpJaHlX
bXlFYzVnazM2OQp1VEc5LzNQS3pWQUpGWGlnbElZUkpBYzN1c25QbklzT29X
VmtXL3ZuR2tzQ2Z2QVpzZXRLeC9iVHJBZnlYWHk4CnNlZTA2MzRsSStob2cz
WWo0Y3J4bWphSHU1N3h6bStrQ24zY3ZWQUVqWkJveEpMZDhrZzE5OTh2bFov
WnJ1VXMKOXNWVEpGSlhXeE93ZkJBTnhlLzRjRlQ1YWRyTlUwSTAyU1djcW5J
NVRLVHdGdzR1bDI4eUhEeGZWbG5pcVhEYgpweDIxVkR3Zkd6NjFNd3VFT29o
OUljNC8rcmQydDRaUVBzMS9WQW5GbXMrWFBLWXRiRTU2Y3JicHMvTVVnVHd3
CmhDREUvUm5yUDNaTEN6NXV2a1c5M25NclpDRTBzUEY2OWlwdVMxSDVNK09x
czV5dDJNT1Yrd1lPQ2lvaUtONXoKeko5c2VoeENQdWtrYXZFOFMvdytBUytF
UVJCSFZsdFVOemhxVWNCaFVINFI1a2ZFNURtN05pMEczSnhMUDhTbQp5OXZX
WU9OWklZemZFczJwWEk3dWJYM1Y0U3FVL2NjT2F1ZlVvM2FocEtwNVZORFVv
TzQxbjlyT2hud2taOVErCkxJNWJIaThRaXBJK0RMWWFKNXZnUW9IYXMwRk1l
S2FnbXA3WmpYN3VoNm1NL3RpK3R1cC9VdGZQdSswRm0vTXgKRHJTa1p2cTFn
Z3l5OTFKNDRGZlgrall0UmdEaERSMHlFQ05hSU16SFFqbEE3Y3VCaWhxUk12
L3UvQWV5Mm9IZgoxUzVRQkpraEhMNllMTmxYWmpPVDdtNlRiMlpLbURBb1Vo
UWZSdHRtSGkwZzN1aEFSUFpYTS9mOUk4M05jaWd5Cmp2RGdlV05CQU9QbDhB
YTFpM2FvaU9LdUtDRyt5ZDdpcGVjbWk3WXQ5TitzeXpLcU9mUldtWGRnM2l4
cVJPNUoKSUxRNW9kUGQzTE1hL2h6N21HUVgrTm1jbTZLcDE0Nm8veWgzTU5W
N3ROV3pGVTQ1dDZBYlVYUUV5a1ZJZUNvUgpMbVRXaUQ3d1FVUFk4Z292eGh4
L2gvNUFKZG8waWdCa0hSSWMyZXVpK1Z0NFJRY2hlNVVWd1ZVbkIzeDFLY0M2
CkdCWmhvck5vc0RNRW9YRk1IclhKYUhsRVRKcDlkcG4xRE1lSThpYitIMXFB
K2lTa0c0WlFtNWMyRktFSStROVoKN1Z1b3pvNWVJQXZHUTdkYXJiNjZNazJk
eHdwSUtMOXZkVFBXK0dlczdITHlNbmtrakZxNE80dHhQWjQ5TFhSSQpXVm4r
cm1NZy9xZlpjVUwxUGlzaWZxaUFlWFlUd0owVTRZdmRLbExaQmdEV0l0REdC
OHl6VkgvUWIwS0JtWExmCnQvMWVXNzkxUTFQbG84MFpHdUZvaXZiK1d1N2NV
NGlocmpuK1FrRmJpeXBDcW82L2FldFM2clhodTg3RGllUlUKYmZQazI2WWFq
b2hXd3dUdG5FWkI3cTNzRGVqUCtWbUQ0MVAxaG45T1N3WThLM1MxT3hqaW9R
PT0KLS0tLS1FTkQgUlNBIFBSSVZBVEUgS0VZLS0tLS0K
</tns:key>
</tns:cancel></env:Body></env:Envelope>